[
    {
        "role":"Senior Developer & IoT Architect",
        "company":"MAC srl Recanati, AN, Italy",
        "summary":"I successfully manage serverless applications in production on the AWS platform. I write code in Node.js and have excellent skills in using the AWS Amplify framework. Excellent operational knowledge of IoT services on the AWS platform. I am also involved in building mobile applications from scratch using Kotlin, Dart and Flutter.",
        "range":"June 2019 - Present"
    },
   {
        "role":"Senior Full-stack Developer",
        "company":"StreetLib srl (formerly Simplicissimus Book Farm) Loreto, AN, Italy",
        "summary":"I wrote production code in Ruby, Node.js, AngularJS and React. I built Ruby on Rails application from the ground up and managed continuous deployment on the AWS cloud infrastrucure.",
        "range":"February 2014 - June 2019"
    },
    {
        "role":"Chief Technology Officer",
        "company":"Simplicissimus Book Farm Loreto, AN, Italy",
        "summary":"Responsible of the entire software development cycle, from the analysis of user needs to prototyping and implementation. Head of the developer team. Wrote production code in Ruby and Python. Wrote functional, unit and integration tests for the quality assurance of applications.",
        "range":"March 2013 - February 2014"
    },
    {
        "role":"Project Manager Mobile Apps",
        "company":"Simplicissimus Book Farm Loreto, AN, Italy",
        "summary":"Responsible of the mobile application development lifecycle, from analysis, to design and implementation. Head of the mobile app developer team. Wrote production code in Objective C and Ruby.",
        "range":"October 2010 - March 2013"
    },
    {
        "role":"System Administrator",
        "company":"3Tech s.r.l. Ancona, AN, Italy",
        "summary":"Linux and Windows senior system administrator. Network Security and Server Virtualization Specialist. I wrote production code in PHP using the Codeignitor Framework.",
        "range":"October 2005 - October 2010"
    },
    {
        "role":"Security and Network Specialist",
        "company":"SITT s.r.l. Ancona, AN, Italy",
        "summary":"Network and Security Specialist. Linux senior system administrator. As a side project, I designed, developed and managed the entire life cycle of SITTmon development. SITTmon was a proactive network monitor hardware platform based on a custom BSD distro.",
        "range":"June 2002 - October 2005"
    },
    {
        "role":"System Administrator & Network Engineer",
        "company":"FASTnet S.p.A Ancona, AN, Italy",
        "summary":"FASTnet was one of the first italian Internet Service Provider. Here I worked as a network and security specialist and as a Linux and Unix system administrator.",
        "range":"1995 - June 2002"
    },
    {
        "role":"Junior Developer",
        "company":"MediaWorks s.a.s. Ancona, AN, Italy",
        "summary":"Software development, desktop publishing, computer graphics, computer animation, and digital video editing.",
        "range":"1991 - 1995"
    }
]